app/Http/Controllers/Auth/AuthenticatedSessionController.php

    public function store(LoginRequest $request): RedirectResponse
    {
        // Check if user is active before authentication
        $user = \App\Models\User::where('email', $request->email)->first();

        if ($user && !$user->is_active) {
            return back()->withErrors([
                'email' => 'บัญชีของคุณถูกปิดใช้งาน กรุณาติดต่อผู้ดูแลระบบ',
            ])->onlyInput('email');
        }

        $request->authenticate();

        $request->session()->regenerate();

        // อัปเดต last_login_at - เพิ่มบรรทัดนี้
        Auth::user()->update(['last_login_at' => now()]);
---
select * from `users` where `email` = 'nattawat@rmutl.ac.th' and `users`.`deleted_at` is null limit 1
update `users` set `last_login_at` = '2025-08-05 23:53:46', `users`.`updated_at` = '2025-08-05 23:53:46' where `id` = 3