app/Http/Controllers/Admin/DashboardController.php

    public function index()
    {
        $stats = [
            'total_users' => User::count(),
            'active_users' => User::where('is_active', true)->count(),
            'inactive_users' => User::where('is_active', false)->count(),
            'total_roles' => Role::count(),
            'recent_users' => User::with('roles')->latest()->take(5)->get(),
---
select count(*) as aggregate from `users` where `is_active` = 1 and `users`.`deleted_at` is null
select count(*) as aggregate from `users` where `is_active` = 0 and `users`.`deleted_at` is null
select count(*) as aggregate from `roles`
select * from `users` where `users`.`deleted_at` is null order by `created_at` desc limit 5
select `roles`.*, `user_roles`.`user_id` as `pivot_user_id`, `user_roles`.`role_id` as `pivot_role_id`, `user_roles`.`created_at` as `pivot_created_at`, `user_roles`.`updated_at` as `pivot_updated_at`, `user_roles`.`assigned_at` as `pivot_assigned_at`, `user_roles`.`assigned_by` as `pivot_assigned_by`, `user_roles`.`expires_at` as `pivot_expires_at` from `roles` inner join `user_roles` on `roles`.`id` = `user_roles`.`role_id` where `user_roles`.`user_id` in (1, 2, 3, 4)